       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERCEPTRON.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WEIGHTS PIC 9(10)V99 OCCURS 0 TO 100 TIMES.
       01 LEARNING-RATE PIC 9(10)V99.
       01 INPUT-SIZE PIC 9(10).
       01 SUMMATION PIC 9(10)V99.
       01 ACTIVATION PIC 9(10).
       01 ERROR PIC 9(10)V99.
       01 PREDICTION PIC 9(10).
       01 ACCURACY PIC 9(10)V99.
       01 INPUTS OCCURS 0 TO 100 TIMES.
           05 INPUT-VALUE PIC 9(10)V99.
       01 LABEL PIC 9(10).
       01 TEST-INPUTS OCCURS 0 TO 100 TIMES.
           05 TEST-INPUT-VALUE PIC 9(10)V99.
       01 TEST-LABELS OCCURS 0 TO 100 TIMES.
           05 TEST-LABEL PIC 9(10).
       01 I PIC 9(10).

       PROCEDURE DIVISION.
       PERCEPTRON-INITIALIZE.
           MOVE ZERO TO WEIGHTS
           MOVE 0.01 TO LEARNING-RATE
           MOVE 0 TO I.

       PERCEPTRON-PREDICT SECTION.
           COMPUTE SUMMATION = 0
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > INPUT-SIZE
               COMPUTE SUMMATION = SUMMATION + INPUTS(I) * WEIGHTS(I)
           END-PERFORM
           ADD WEIGHTS(INPUT-SIZE + 1) TO SUMMATION
           IF SUMMATION > 0 THEN
               MOVE 1 TO ACTIVATION
           ELSE
               MOVE 0 TO ACTIVATION
           END-IF.

       PERCEPTRON-TRAIN SECTION.
           PERFORM PERCEPTRON-PREDICT
           MOVE PREDICTION TO PREDICTION
           COMPUTE ERROR = LABEL - PREDICTION
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > INPUT-SIZE
               COMPUTE WEIGHTS(I) = WEIGHTS(I) + LEARNING-RATE * ERROR * INPUTS(I)
           END-PERFORM
           COMPUTE WEIGHTS(INPUT-SIZE + 1) = WEIGHTS(INPUT-SIZE + 1) + LEARNING-RATE * ERROR.

       PERCEPTRON-ACCURACY SECTION.
           COMPUTE ACCURACY = 0
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > LENGTH OF TEST-INPUTS
               PERFORM PERCEPTRON-PREDICT
               IF PREDICTION = TEST-LABELS(I) THEN
                   ADD 1 TO ACCURACY
               END-IF
           END-PERFORM
           COMPUTE ACCURACY = ACCURACY / LENGTH OF TEST-INPUTS.

